IDEA StatiCa Open Model
OpenModel.LineSupportSegment Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 List of Line support on segment
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<LineSupportSegment> LineSupportSegment { get; set; }
Public Property LineSupportSegment As List(Of LineSupportSegment)
	Get
	Set
public:
property List<LineSupportSegment^>^ LineSupportSegment {
	List<LineSupportSegment^>^ get ();
	void set (List<LineSupportSegment^>^ value);
}
Property Value
Type: List<LineSupportSegment>
See Also
Reference
OpenModel Class
IdeaRS.OpenModel Namespace